Autodesk.Revit.DB.Architecture.WallPlacementPostProcessingServiceData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Architecture.WallPlacementPostProcessingServiceData.NeedRegen
Whether need a regen after the service is executed
Since:
2025

Autodesk.Revit.DB.Architecture.WallPlacementPostProcessingServiceData.WallId
The new wall just created.
Since:
2025

Autodesk.Revit.DB.Architecture.WallPlacementPostProcessingServiceData.Document
The document.
Since:
2025

Autodesk.Revit.DB.Architecture.WallPlacementPostProcessingServiceData.#ctor
Since:
2025

Autodesk.Revit.DB.Architecture.WallPlacementPostProcessingServiceData
This is a container of data for post processing of wall placement
Since:
2025